TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_outputxbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUT3MUX32TO47CFG register
//
//*************************************************************************************************
#define XBAR_OUTPUT3MUX32TO47CFG_MUX32_S   0U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX32_M   0x3U          // MUX32 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX33_S   2U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX33_M   0xCU          // MUX33 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX34_S   4U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX34_M   0x30U         // MUX34 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX35_S   6U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX35_M   0xC0U         // MUX35 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX36_S   8U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX36_M   0x300U        // MUX36 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX37_S   10U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX37_M   0xC00U        // MUX37 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX38_S   12U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX38_M   0x3000U       // MUX38 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX39_S   14U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX39_M   0xC000U       // MUX39 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX40_S   16U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX40_M   0x30000U      // MUX40 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX41_S   18U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX41_M   0xC0000U      // MUX41 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX42_S   20U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX42_M   0x300000U     // MUX42 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX43_S   22U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX43_M   0xC00000U     // MUX43 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX44_S   24U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX44_M   0x3000000U    // MUX44 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX45_S   26U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX45_M   0xC000000U    // MUX45 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX46_S   28U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX46_M   0x30000000U   // MUX46 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX32TO47CFG_MUX47_S   30U
#define XBAR_OUTPUT3MUX32TO47CFG_MUX47_M   0xC0000000U   // MUX47 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUT3MUX48TO63CFG register
//
//*************************************************************************************************
#define XBAR_OUTPUT3MUX48TO63CFG_MUX48_S   0U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX48_M   0x3U          // MUX48 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX49_S   2U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX49_M   0xCU          // MUX49 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX50_S   4U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX50_M   0x30U         // MUX50 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX51_S   6U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX51_M   0xC0U         // MUX51 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX52_S   8U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX52_M   0x300U        // MUX52 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX53_S   10U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX53_M   0xC00U        // MUX53 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX54_S   12U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX54_M   0x3000U       // MUX54 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX55_S   14U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX55_M   0xC000U       // MUX55 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX56_S   16U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX56_M   0x30000U      // MUX56 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX57_S   18U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX57_M   0xC0000U      // MUX57 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX58_S   20U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX58_M   0x300000U     // MUX58 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX59_S   22U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX59_M   0xC00000U     // MUX59 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX60_S   24U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX60_M   0x3000000U    // MUX60 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX61_S   26U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX61_M   0xC000000U    // MUX61 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX62_S   28U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX62_M   0x30000000U   // MUX62 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT3MUX48TO63CFG_MUX63_S   30U
#define XBAR_OUTPUT3MUX48TO63CFG_MUX63_M   0xC0000000U   // MUX63 Configuration for OUTPUT3 of
                                                         // OUTPUT-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUT4MUX0TO15CFG register
//
//*************************************************************************************************
#define XBAR_OUTPUT4MUX0TO15CFG_MUX0_S    0U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX0_M    0x3U          // Mux0 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX1_S    2U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX1_M    0xCU          // Mux1 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX2_S    4U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX2_M    0x30U         // Mux2 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX3_S    6U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX3_M    0xC0U         // Mux3 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX4_S    8U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX4_M    0x300U        // Mux4 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX5_S    10U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX5_M    0xC00U        // Mux5 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX6_S    12U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX6_M    0x3000U       // Mux6 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX7_S    14U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX7_M    0xC000U       // Mux7 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX8_S    16U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX8_M    0x30000U      // Mux8 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX9_S    18U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX9_M    0xC0000U      // Mux9 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX10_S   20U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX10_M   0x300000U     // Mux10 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX11_S   22U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX11_M   0xC00000U     // Mux11 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX12_S   24U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX12_M   0x3000000U    // Mux12 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX13_S   26U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX13_M   0xC000000U    // Mux13 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX14_S   28U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX14_M   0x30000000U   // Mux14 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX0TO15CFG_MUX15_S   30U
#define XBAR_OUTPUT4MUX0TO15CFG_MUX15_M   0xC0000000U   // Mux15 Configuration for OUTPUT4 of
                                                        // OUTPUT-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUT4MUX16TO31CFG register
//
//*************************************************************************************************
#define XBAR_OUTPUT4MUX16TO31CFG_MUX16_S   0U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX16_M   0x3U          // Mux16 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX17_S   2U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX17_M   0xCU          // Mux17 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX18_S   4U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX18_M   0x30U         // Mux18 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX19_S   6U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX19_M   0xC0U         // Mux19 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX20_S   8U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX20_M   0x300U        // Mux20 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX21_S   10U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX21_M   0xC00U        // Mux21 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX22_S   12U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX22_M   0x3000U       // Mux22 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX23_S   14U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX23_M   0xC000U       // Mux23 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX24_S   16U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX24_M   0x30000U      // Mux24 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX25_S   18U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX25_M   0xC0000U      // Mux25 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX26_S   20U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX26_M   0x300000U     // Mux26 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX27_S   22U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX27_M   0xC00000U     // Mux27 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX28_S   24U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX28_M   0x3000000U    // Mux28 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX29_S   26U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX29_M   0xC000000U    // Mux29 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX30_S   28U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX30_M   0x30000000U   // Mux30 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX16TO31CFG_MUX31_S   30U
#define XBAR_OUTPUT4MUX16TO31CFG_MUX31_M   0xC0000000U   // Mux31 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUT4MUX32TO47CFG register
//
//*************************************************************************************************
#define XBAR_OUTPUT4MUX32TO47CFG_MUX32_S   0U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX32_M   0x3U          // MUX32 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX33_S   2U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX33_M   0xCU          // MUX33 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX34_S   4U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX34_M   0x30U         // MUX34 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX35_S   6U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX35_M   0xC0U         // MUX35 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX36_S   8U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX36_M   0x300U        // MUX36 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX37_S   10U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX37_M   0xC00U        // MUX37 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX38_S   12U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX38_M   0x3000U       // MUX38 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX39_S   14U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX39_M   0xC000U       // MUX39 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX40_S   16U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX40_M   0x30000U      // MUX40 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX41_S   18U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX41_M   0xC0000U      // MUX41 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX42_S   20U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX42_M   0x300000U     // MUX42 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX43_S   22U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX43_M   0xC00000U     // MUX43 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX44_S   24U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX44_M   0x3000000U    // MUX44 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX45_S   26U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX45_M   0xC000000U    // MUX45 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX46_S   28U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX46_M   0x30000000U   // MUX46 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX32TO47CFG_MUX47_S   30U
#define XBAR_OUTPUT4MUX32TO47CFG_MUX47_M   0xC0000000U   // MUX47 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUT4MUX48TO63CFG register
//
//*************************************************************************************************
#define XBAR_OUTPUT4MUX48TO63CFG_MUX48_S   0U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX48_M   0x3U          // MUX48 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX49_S   2U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX49_M   0xCU          // MUX49 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX50_S   4U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX50_M   0x30U         // MUX50 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX51_S   6U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX51_M   0xC0U         // MUX51 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX52_S   8U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX52_M   0x300U        // MUX52 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX53_S   10U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX53_M   0xC00U        // MUX53 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX54_S   12U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX54_M   0x3000U       // MUX54 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX55_S   14U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX55_M   0xC000U       // MUX55 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX56_S   16U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX56_M   0x30000U      // MUX56 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX57_S   18U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX57_M   0xC0000U      // MUX57 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX58_S   20U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX58_M   0x300000U     // MUX58 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX59_S   22U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX59_M   0xC00000U     // MUX59 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX60_S   24U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX60_M   0x3000000U    // MUX60 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX61_S   26U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX61_M   0xC000000U    // MUX61 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX62_S   28U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX62_M   0x30000000U   // MUX62 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR
#define XBAR_OUTPUT4MUX48TO63CFG_MUX63_S   30U
#define XBAR_OUTPUT4MUX48TO63CFG_MUX63_M   0xC0000000U   // MUX63 Configuration for OUTPUT4 of
                                                         // OUTPUT-XBAR

